; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pickup
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
(define (problem transport-38)
 (:domain transport)
 (:objects 
    v1 - vehicle
    p1 p2 p3 p4 p5 p6 p7 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 - location
    c0 c1 c2 - size
    )
 (:init
    (capacity v1 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l4)
    (at p2 l4)
    (at p3 l8)
    (at p4 l3)
    (at p5 l2)
    (at p6 l6)
    (at p7 l1)
    (at v1 l4)
    (road l7 l5)
    (road l1 l5)
    (road l5 l8)
    (road l6 l1)
    (road l4 l6)
    (road l5 l1)
    (road l9 l2)
    (road l6 l4)
    (road l5 l7)
    (road l2 l9)
    (road l5 l3)
    (road l8 l2)
    (road l1 l6)
    (road l8 l5)
    (road l3 l5)
    (road l2 l8)
    (road l6 l7)
    (road l7 l6)
    (road l7 l8)
    (road l8 l7)
    (road l7 l9)
    (road l9 l7)
    (road l1 l8)
    (road l8 l1)
    (road l2 l3)
    (road l3 l2)
    (road l4 l7)
    (road l7 l4)
    (road l4 l9)
    (road l9 l4)
    (road l1 l4)
    (road l4 l1)
    (road l3 l7)
    (road l7 l3)
    (road l3 l9)
    (road l9 l3)
    (road l4 l5)
    (road l5 l4)
    (road l4 l8)
    (road l8 l4)
    (road l2 l6)
    (road l6 l2)
    (road l1 l2)
    (road l2 l1)
    )
 (:goal  (and 
    (at p1 l9)
    (at p2 l9)
    (at p3 l1)
    (at p4 l9)
    (at p5 l6)
    (at p6 l1)
    (at p7 l7))))

; plan
1. (pickup v1 l4 p1 c0 c1)
   deleted: (at p1 l4) (capacity v1 c1)
   added: (in p1 v1) (capacity v1 c0)
   goals met: 0 of 7
2. (drive v1 l4 l9)
   deleted: (at v1 l4)
   added: (at v1 l9)
   goals met: 0 of 7
3. (drop v1 l9 p1 c0 c1)
   deleted: (in p1 v1) (capacity v1 c0)
   added: (at p1 l9) (capacity v1 c1)
   goals met: 1 of 7
4. (drive v1 l9 l4)
   deleted: (at v1 l9)
   added: (at v1 l4)
   goals met: 1 of 7
5. (pickup v1 l4 p2 c0 c1)
   deleted: (at p2 l4) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 1 of 7
6. (drive v1 l4 l9)
   deleted: (at v1 l4)
   added: (at v1 l9)
   goals met: 1 of 7
7. (drop v1 l9 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l9) (capacity v1 c1)
   goals met: 2 of 7
8. (drive v1 l9 l2)
   deleted: (at v1 l9)
   added: (at v1 l2)
   goals met: 2 of 7
9. (drive v1 l2 l8)
   deleted: (at v1 l2)
   added: (at v1 l8)
   goals met: 2 of 7
10. (pickup v1 l8 p3 c0 c1)
   deleted: (at p3 l8) (capacity v1 c1)
   added: (in p3 v1) (capacity v1 c0)
   goals met: 2 of 7
11. (drive v1 l8 l1)
   deleted: (at v1 l8)
   added: (at v1 l1)
   goals met: 2 of 7
12. (drop v1 l1 p3 c0 c1)
   deleted: (in p3 v1) (capacity v1 c0)
   added: (at p3 l1) (capacity v1 c1)
   goals met: 3 of 7
13. (drive v1 l1 l5)
   deleted: (at v1 l1)
   added: (at v1 l5)
   goals met: 3 of 7
14. (drive v1 l5 l3)
   deleted: (at v1 l5)
   added: (at v1 l3)
   goals met: 3 of 7
15. (pickup v1 l3 p4 c0 c1)
   deleted: (at p4 l3) (capacity v1 c1)
   added: (in p4 v1) (capacity v1 c0)
   goals met: 3 of 7
16. (drive v1 l3 l9)
   deleted: (at v1 l3)
   added: (at v1 l9)
   goals met: 3 of 7
17. (drop v1 l9 p4 c0 c1)
   deleted: (in p4 v1) (capacity v1 c0)
   added: (at p4 l9) (capacity v1 c1)
   goals met: 4 of 7
18. (drive v1 l9 l2)
   deleted: (at v1 l9)
   added: (at v1 l2)
   goals met: 4 of 7
19. (pickup v1 l2 p5 c0 c1)
   deleted: (at p5 l2) (capacity v1 c1)
   added: (in p5 v1) (capacity v1 c0)
   goals met: 4 of 7
20. (drive v1 l2 l6)
   deleted: (at v1 l2)
   added: (at v1 l6)
   goals met: 4 of 7
21. (drop v1 l6 p5 c0 c1)
   deleted: (in p5 v1) (capacity v1 c0)
   added: (at p5 l6) (capacity v1 c1)
   goals met: 5 of 7
22. (pickup v1 l6 p6 c0 c1)
   deleted: (at p6 l6) (capacity v1 c1)
   added: (in p6 v1) (capacity v1 c0)
   goals met: 5 of 7
23. (drive v1 l6 l1)
   deleted: (at v1 l6)
   added: (at v1 l1)
   goals met: 5 of 7
24. (drop v1 l1 p6 c0 c1)
   deleted: (in p6 v1) (capacity v1 c0)
   added: (at p6 l1) (capacity v1 c1)
   goals met: 6 of 7
25. (pickup v1 l1 p7 c0 c1)
   deleted: (at p7 l1) (capacity v1 c1)
   added: (in p7 v1) (capacity v1 c0)
   goals met: 6 of 7
26. (drive v1 l1 l5)
   deleted: (at v1 l1)
   added: (at v1 l5)
   goals met: 6 of 7
27. (drive v1 l5 l7)
   deleted: (at v1 l5)
   added: (at v1 l7)
   goals met: 6 of 7
28. (drop v1 l7 p7 c0 c1)
   deleted: (in p7 v1) (capacity v1 c0)
   added: (at p7 l7) (capacity v1 c1)
   goals met: 7 of 7
